# -*- coding:utf-8 -*-

from libzhilian import *
from bs4 import BeautifulSoup
import logging.config
import json,traceback,datetime,time,urllib,urlparse
import common
import MySQLdb


class TransportZhlian(zhilianfetch):
	def __init__(self):
		zhilianfetch.__init__(self)
		self.get_dict = {'SF_1_1_27': '0', 'orderBy': 'DATE_MODIFIED%2C1', 'pageSize': '60', 'exclude': '1', 'pageIndex': '1'}
		self.area_dict = {u'北京': '530', u'上海': '538', u'广州': '763', u'深圳': '765'}
		self.convert_degree = {u'初中': '1%2C1', u'中技': '2%2C2', u'高中': '3%2C3', u'中专': '4%2C4',
								u'大专': '5%25', u'本科': '7%2C7', u'硕士': '9%2C9', 'MBA': '11%2C11',
								'EMBA': '13%2C13', u'博士': '15%2C15', u'以上': '2C16'}
		self.convert_year = {u'无经验': '0%2C0', u'1年': '1%2C1'}
		self.convert_update_time = {u'不限': '2%2C7', u'最近三天': '1%2C9', u'最近一周': '2%2C9', u'最近二周': '3%2C9',
									u'最近一个月': '4%2C9', u'最近两个月': '5%2C9', u'最近三个月': '6%2C9', u'最近六个月': '7%2C9',
									u'最近一年': '8%2C9'}
		# self.convert_industry = {u'计算机软件': '160400', u'互联网': '210500', u'IT服务': '160000', u'电子技术': '160500',
		# 							u'通信': '300100', u'网络游戏': '160600', u'电信运营': '160100'}
		self.convert_industry = {u'信托/担保/拍卖/典当': '300900', u'通信/电信运营、增值服务': '160100', u'互联网/电子商务': '210500',
								u'办公用品及设备': '120700', u'计算机软件': '160400', u'通信/电信/网络设备': '300100', u'酒店/餐饮': '200600',
							u'石油/石化/化工': '120500', u'农/林/牧/渔': '100000', u'政府/公共事业/非盈利机构': '200100',
							u'礼品/玩具/工艺美术/收藏品/奢侈品': '120800', u'大型设备/机电设备/重工业': '129900', u'外包服务': '300300',
							u'医药/生物工程': '121300', u'跨领域经营': '100100', u'娱乐/体育/休闲': '200700', u'教育/培训/院校': '201100',
							u'房地产/建筑/建材/工程': '140000', u'其他': '990000', u'基金/证券/期货/投资': '180000', u'零售/批发': '170000',
							u'物流/仓储': '301100', u'汽车/摩托车': '121000', u'耐用消费品（服饰/纺织/皮革/家具/家电）': '120200', u'交通/运输': '150000',
							u'计算机硬件': '160200', u'环保': '201200', u'网络游戏': '160600', u'银行': '300500', u'航空/航天研究与制造': '300000',
							u'仪器仪表及工业自动化': '121200', u'家居/室内设计/装饰装潢': '140100', u'广告/会展/公关': '200302', u'租赁服务': '300700',
							u'能源/矿产/采掘/冶炼': '130000', u'专业服务/咨询(财会/法律/人力资源等)': '200300', u'印刷/包装/造纸': '210600',
							u'电气/电力/水利': '130100', u'媒体/出版/影视/文化传播': '210300', u'电子技术/半导体/集成电路': '160500',
							u'快速消费品（食品/饮料/烟酒/日化）': '120400', u'中介服务': '201400', u'医疗/护理/美容/保健/卫生服务': '121400',
							u'检验/检测/认证': '201300', u'学术/科研': '120600', u'加工制造（原料加工/模具）': '121100', u'医疗设备/器械': '121500',
							u'旅游/度假': '200800', u'物业管理/商业中心': '140200', u'贸易/进出口': '170500', u'IT服务(系统/数据/维护)': '160000', u'保险': '180100'}

		# self.convert_func = {u'软件工程师': '045', u'软件开发': '160000', u'互联网产品': '160200',
		# 					u'IT运维': '200500', u'通信技术': '5001000', u'手机软件开发': '679'}

		self.convert_func = {u'影视/媒体/出版/印刷': '2120000', u'机械设计/制造/维修': '5003000', u'能源/矿产/地质勘查': '130000',
							u'保健/美容/美发/健身': '2050000', u'技工/操作工': '5004000', u'广告/会展': '7004000', u'银行': '2071000',
							u'志愿者/社会工作者': '200700', u'实习生/培训生/储备干部': '5006000', u'项目管理/项目协调': '201300',
							u'生产管理/运营': '121100', u'IT运维/技术支持': '200500', u'医院/医疗/护理': '2051000',
							u'咨询/顾问/调研/数据分析': '2140000', u'公务员/事业单位/科研机构': '200100', u'销售业务': '4010200',
							u'公关/媒介': '4084000', u'人力资源': '5002000', u'销售管理': '7001000', u'IT质量管理/测试/配置管理': '160400',
							u'采购/贸易': '4083000', u'证券/期货/投资管理/服务': '2070000', u'汽车销售与服务': '7003100',
							u'土木/建筑/装修/市政工程': '140000', u'服装/纺织/皮革设计/生产': '7005000', u'电子/电器/半导体/仪器仪表': '160100',
							u'汽车制造': '7003000', u'烹饪/料理/食品研发': '201100', u'旅游/度假/出入境服务': '4040000', u'保险': '7006000',
							u'商超/酒店/娱乐管理/服务': '5005000', u'IT管理/项目协调': '200300', u'社区/居民/家政服务': '6270000',
							u'互联网产品/运营管理': '160200', u'兼职/临时': '300100', u'高级管理': '1050000',
							u'物业管理': '142000', u'农/林/牧/渔业': '100000', u'行政/后勤/文秘': '3010000', u'交通运输服务': '4010300',
							u'房地产开发/经纪/中介': '141000', u'市场': '4082000', u'生物/制药/医疗器械': '121300', u'财务/审计/税务': '2060000',
							u'质量管理/安全防护': '2023405', u'环境科学/环保': '2023100', u'客服/售前/售后技术支持': '4000000',
							u'律师/法务/合规': '2080000', u'翻译（口译与笔译）': '2120500', u'艺术/设计': '2100708', u'教育/培训': '2090000',
							u'化工': '120500', u'信托/担保/拍卖/典当': '200900', u'硬件开发': '160300', u'销售行政/商务': '7002000',
							u'物流/仓储': '4010400', u'电信/通信技术开发及应用': '5001000', u'软件/互联网开发/系统集成': '160000',
							u'设备主管': '2015', u'船舶维修/保养': '922', u'医药技术研发人员': '2019', u'发动机/总装工程师': '2236',
							 u'化妆师': '640', u'保险核安': '2253', u'算法工程师': '2034', u'统计员': '214', u'浆纱工': '2247',
							 u'融资经理/主管': '809', u'市场策划/企划经理/主管': '161', u'合规经理': '2113', u'首席运营官COO': '138',
							 u'测试/可靠性工程师': '410', u'销售工程师': '009', u'汽车底盘/总装工程师': '474', u'行长/副行长': '716',
							 u'送餐员': '2074', u'岩土工程': '707', u'高级软件工程师': '044', u'客房管理': '636', u'校长/副校长': '624',
							 u'化学操作': '111', u'财务经理': '201', u'数控编程': '2199', u'模具工程师': '588', u'游戏界面设计': '867',
							 u'生产计划': '487', u'服装打样/制版': '522', u'生鲜食品加工/处理': '2223', u'家具设计': '366',
							 u'订单处理员': '2169', u'喷塑工': '2212', u'客户服务专员/助理': '257', u'艺术/设计总监': '2125',
							 u'工业工程师': '2189', u'计算机硬件维护工程师': '678', u'运输经理/主管': '353', u'产品运营': '2059',
							 u'化学制剂研发': '371', u'通信电源工程师': '326', u'安检员': '2154', u'潜水员': '2171', u'多媒体/动画设计': '151',
							 u'宠物护理和美容': '233', u'物业管理专员/助理': '095', u'项目总监': '813', u'橡胶工程师': '2006', u'瓦工': '2217',
							 u'设计管理人员': '364', u'品酒师': '2077', u'列车维修/保养': '920', u'成本管理员': '2099', u'列车设计与制造': '595',
							 u'品牌经理': '168', u'临时': '300', u'ERP实施顾问': '551', u'渠道/分销总监': '003', u'电脑操作/打字/录入员': '498',
							 u'客户服务/续期管理': '541', u'演员/模特': '893', u'IT项目总监': '817', u'客户经理': '004', u'货运代理': '740',
							 u'广告创意/设计总监': '756', u'ERP技术/开发应用': '048', u'音乐教师': '790', u'医疗器械推广': '378', u'质量管理': '2226',
							 u'信息技术经理/主管': '040', u'市场调研与分析': '167', u'广告客户总监': '855', u'旅游计划调度': '531', u'产品管理': '871',
							 u'网店运营': '2054', u'综合门诊/全科医生': '229', u'市场营销主管': '601', u'面料辅料开发/采购': '521', u'总编/副总编': '367',
							 u'锅炉工程师/技师': '2194', u'电子元器件工程师': '082', u'自动化工程师': '033', u'西餐厨师': '2070', u'故障分析工程师': '2082',
							 u'市场专员/助理': '171', u'行政总监': '328', u'网络与信息安全工程师': '059', u'房地产项目开发报建': '701', u'新媒体运营': '2050', u'化妆品研发': '2008', u'律师助理': '860', u'平面设计总监': '2119', u'吊车司机/卡车司机': '2214', u'副总裁/副总经理': '140', u'用户界面（UI）设计': '669', u'化学/化工技术总监': '2010', u'房地产销售/置业顾问': '708', u'生产物料管理（PMC）': '069', u'招聘专员/助理': '124', u'食品/饮料研发': '596', u'担保业务': '921', u'安全消防': '384', u'物流/仓储调度': '394', u'建筑工程安全管理': '565', u'日式厨师': '2071', u'销售代表': '006', u'水运/空运/陆运操作': '746', u'家电维修': '2229', u'理疗师': '804', u'医药技术研发管理人员': '764', u'产品主管': '848', u'供应链总监': '2162', u'搬运工': '806', u'内科医生': '642', u'职业技术教师': '626', u'飞机设计与制造': '735', u'业务跟单经理': '2177', u'临床研究员': '293', u'IT项目经理/主管': '818', u'切纸机操作工': '2135', u'网站编辑': '056', u'信托服务': '930', u'智能大厦/布线/弱电/安防': '289', u'建筑设计师': '884', u'电声/音响工程师/技术员': '2045', u'俄语翻译': '272', u'食品/饮料检验': '836', u'幕墙工程师': '564', u'工程造价/预结算': '102', u'按摩/足疗': '641', u'施工队长': '706', u'化学实验室技术员/研究员': '504', u'语音/视频/图形开发': '317', u'营养师': '649', u'人力资源主管': '618', u'IT技术文员/助理': '690', u'建筑制图': '703', u'控制保护研发工程师': '2022', u'国际贸易主管/专员': '2180', u'眼科医生/验光师': '648', u'证券/投资客户总监': '910', u'可靠度工程师': '2081', u'油漆/化工涂料研发': '505', u'运营主管/专员': '2056', u'行政主厨': '2068', u'调研员': '623', u'水利/水电工程师': '617', u'基金项目经理': '2103', u'水处理工程师': '615', u'客户关系/投诉协调人员': '261', u'打稿机操作员': '2134', u'系统分析员': '668', u'项目计划合约专员': '2079', u'化学分析': '396', u'供应链经理/主管': '2163', u'平面设计': '149', u'IT质量管理经理/主管': '693', u'汽车定损/车险理赔': '726', u'酒店试睡员': '2224', u'化学技术应用': '112', u'外贸/贸易专员/助理': '237', u'广告/会展业务拓展': '508', u'法务专员/助理': '629', u'施工员': '107', u'内勤人员': '2146', u'机械研发工程师': '584', u'药品生产/质量管理': '294', u'半导体技术': '081', u'签证业务办理': '800', u'媒介经理/主管': '164', u'客户代表': '008', u'股票/期货操盘手': '577', u'固废处理工程师': '903', u'厨师/面点师': '275', u'物业租赁/销售': '101', u'网店店长': '2051', u'房地产内勤': '2031', u'咨询总监': '216', u'保险顾问/财务规划师': '537', u'西点师': '2072', u'房地产中介/交易': '105', u'配色技术员': '2007', u'售前/售后技术支持管理': '258', u'文字编辑/组稿': '176', u'机械维修/保养': '589', u'促销主管/督导': '896', u'生产文员': '2012', u'技术研发经理/主管': '2185', u'复卷工': '2137', u'品牌/连锁招商管理': '493', u'公关经理/主管': '606', u'美发培训师': '2084', u'电力电子研发工程师': '2021', u'月嫂': '2228', u'认证/体系工程师/审核员': '253', u'包装设计': '150', u'电子/电器工艺/制程工程师': '091', u'人力资源总监': '120', u'保险培训师': '543', u'无损检测工程师': '2200', u'客房服务员': '2222', u'烧烤师': '2076', u'阿拉伯语翻译': '633', u'维修经理/主管': '2190', u'外贸/贸易经理/主管': '312', u'IOS开发工程师': '2038', u'物流销售': '2161', u'美发/发型师': '377', u'数据分析师': '894', u'餐厅领班': '2066', u'IT质量管理工程师': '049', u'房地产销售经理': '709', u'药品研发': '776', u'船员/水手': '878', u'科研管理人员': '362', u'店长/卖场管理': '895', u'总工程师/副总工程师': '2011', u'企业秘书/董事会秘书': '2003', u'储备经理人': '544', u'资产评估': '579', u'市场经理': '600', u'临床协调员': '877', u'音频/视频工程师/技术员': '402', u'幼教': '361', u'印刷操作': '613', u'教育产品开发': '135', u'融资总监': '346', u'产品专员/助理': '849', u'证券/投资客户代表': '909', u'仓库经理/主管': '243', u'个人业务': '573', u'采购专员/助理': '236', u'品牌主管': '603', u'服装/纺织/皮革工艺师': '739', u'初中教师': '627', u'采购材料/设备管理': '2083', u'IT技术支持/维护工程师': '315', u'硬装设计师': '2026', u'中餐厨师': '2069', u'需求工程师': '665', u'实习生': '299', u'空调工程/设计': '560', u'空调工/电梯工/锅炉工': '340', u'畜牧师': '657', u'裱胶工': '2136', u'物业经理/主管': '393', u'装配工程师/客户经理': '2191', u'电镀工': '2211', u'嵌入式软件开发': '687', u'校对/录入': '395', u'美术教师': '906', u'企业律师/合规经理/主管': '363', u'纺织工/针织工': '2242', u'生产项目工程师': '822', u'汽车电子工程师': '476', u'生产运营管理': '932', u'兽医': '898', u'门卫': '2225', u'剪裁工': '2240', u'仪表工': '2210', u'电子商务总监': '2049', u'浮法操作工(玻璃技术)': '2201', u'手机软件开发工程师': '679', u'电气设计': '467', u'国外求职': '2143', u'机修工': '2203', u'作家/编剧/撰稿人': '762', u'微信推广': '2057', u'固定资产会计': '2098', u'医疗器械注册': '771', u'法语翻译': '271', u'漂染工': '2245', u'社会工作者/社工': '838', u'电力线路工': '2208', u'学徒工': '2221', u'部门/事业部管理': '144', u'系统测试': '694', u'系统管理员': '051', u'高级建筑工程师/总工': '350', u'经销商': '2149', u'牙科医生': '645', u'儿科医生': '644', u'银行会计/柜员': '193', u'医疗器械生产/质量管理': '772', u'预订员': '796', u'音效师': '890', u'农艺师': '656', u'公司业务部门经理/主管': '2109', u'通信技术工程师': '680', u'品类管理': '634', u'企业律师/合规顾问': '224', u'杂工': '2078', u'软装设计师': '2023', u'区域销售专员/助理': '925', u'其他': '546', u'医疗管理人员': '228', u'配色工': '2243', u'汽车机械工程师': '475', u'摄影师/摄像师': '179', u'增值产品开发工程师': '2183', u'审计经理/主管': '212', u'培训经理/主管': '125', u'互联网产品专员/助理': '675', u'高级客户经理/客户经理': '2110', u'助理业务跟单': '2179', u'数据运营': '2060', u'招商主管': '2151', u'生产总监': '869', u'原画师': '754', u'公交/地铁乘务': '594', u'医药项目管理': '826', u'项目专员/助理': '815', u'金融产品经理': '2101', u'金融租赁': '2107', u'人事信息系统(HRIS)管理': '779', u'PHP开发工程师': '2041', u'旅游产品/线路策划': '897', u'项目经理/主管': '2166', u'仓库/物料管理员': '244', u'大客户销售代表': '926', u'船舶驾驶/操作': '880', u'气动工程师': '587', u'证券/期货/外汇经纪人': '187', u'安全性能工程师': '478', u'物料经理': '2164', u'美容师/美甲师': '639', u'贸易跟单': '238', u'通信标准化工程师': '558', u'电子技术研发工程师': '686', u'财务总监': '200', u'培训专员/助理': '126', u'分公司/代表处负责人': '141', u'行李员': '798', u'物流经理/主管': '597', u'银行客户代表': '889', u'编辑出版': '2121', u'信息技术专员': '041', u'压痕工': '2138', u'区域销售总监': '005', u'韩语/朝鲜语翻译': '273', u'服装/纺织品设计': '155', u'广告客户经理': '506', u'资金专员': '715', u'电子/电器维修/保养': '403', u'化验师': '2016', u'招商专员': '2152', u'助理/秘书/文员': '116', u'前台/总机/接待': '117', u'项目管理': '2187', u'保险精算师': '348', u'医药项目招投标管理': '769', u'行政经理/主管/办公室主任': '114', u'绘画': '753', u'保安经理': '805', u'高级硬件工程师': '314', u'室内装潢设计': '100', u'人力资源经理': '121', u'包装工': '2207', u'房地产项目招投标': '883', u'地勤人员': '736', u'税务专员/助理': '210', u'房地产资产管理': '2028', u'地铁轨道设计': '2202', u'质量管理/测试经理': '249', u'企业培训师/讲师': '858', u'汽车装配工艺工程师': '472', u'交通管理员': '2156', u'高中教师': '625', u'房地产项目管理': '830', u'Helpdesk': '698', u'印刷机械机长': '2139', u'模拟电路设计/应用工程师': '406', u'工程机械经理': '332', u'美容整形师': '2090', u'产品经理': '847', u'加油站工作员': '2235', u'清算人员': '723', u'人力资源专员/助理': '122', u'银行客户总监': '887', u'互联网软件工程师': '053', u'美容整形科医生': '899', u'质量管理/测试主管': '250', u'金融产品销售': '2102', u'排版设计': '181', u'线路结构设计': '682', u'渠道/分销经理/主管': '453', u'培训/招生/课程顾问': '789', u'放映员': '2123', u'挡车工': '2246', u'主持人/司仪': '637', u'葡萄牙语翻译': '632', u'品牌专员/助理': '170', u'储备干部': '301', u'咨询经理/主管': '217', u'出纳员': '208', u'售后服务/客户服务': '2234', u'文档/资料管理': '859', u'财务分析员': '204', u'IT技术/研发总监': '928', u'IT技术/研发经理/主管': '313', u'咨询师': '2142', u'电气线路设计': '683', u'会计经理/主管': '206', u'保险业务管理': '535', u'广告美术指导': '512', u'院长': '2094', u'夹具工程师': '873', u'单证员': '490', u'银行客户服务': '192', u'硬件工程师': '043', u'理科教师': '791', u'业务分析经理/主管': '2230', u'IC验证工程师': '405', u'市政工程师': '562', u'媒介专员/助理': '165', u'服务员': '279', u'项目经理/项目主管': '814', u'高尔夫教练': '2086', u'物流专员/助理': '242', u'员工关系/企业文化/工会': '620', u'Android开发工程师': '2039', u'旅游产品销售': '799', u'IT文档工程师': '699', u'车身设计工程师': '470', u'飞机维修/保养': '734', u'机械制图员': '334', u'会籍顾问': '2153', u'集装箱操作': '2160', u'小学教师': '628', u'手机维修': '2065', u'机械设计师': '093', u'美容顾问(BA)': '802', u'通信项目管理': '499', u'广告文案策划': '509', u'运营总监': '2047', u'理货/分拣/打包': '745', u'厨工': '801', u'工艺/制程工程师': '072', u'给排水/暖通/空调工程': '099', u'船舶乘务': '881', u'列车乘务': '489', u'服装/纺织品/皮革质量管理': '519', u'CAD设计/制图': '608', u'洗车工': '2215', u'安防系统工程师': '808', u'代驾': '2158', u'销售经理': '001', u'证券/投资客户经理': '191', u'医疗器械研发': '876', u'公关总监': '162', u'办事处首席代表': '2001', u'机械设备经理': '729', u'用户体验（UE/UX）设计': '862', u'化工研发工程师': '502', u'选址拓展/新店开发': '747', u'生产设备管理': '068', u'放映管理': '760', u'保险契约管理': '545', u'产品策划工程师': '2186', u'海外游计调': '2172', u'中医科医生': '646', u'首席执行官CEO/总裁/总经理': '136', u'机械工艺/制程工程师': '585', u'物业顾问': '712', u'呼叫中心客服': '2148', u'工程资料管理': '704', u'外语教师': '793', u'印刷排版/制版': '533', u'汽车机构工程师': '2232', u'绩效考核专员/助理': '778', u'楼面管理': '016', u'广告客户主管': '856', u'钢筋工': '2220', u'行政专员/助理': '115', u'银行客户主管': '888', u'射频工程师': '684', u'药品注册': '875', u'汽车零部件设计师': '473', u'轨道交通工程师/技术员': '2197', u'计算机辅助设计师': '2036', u'移动互联网开发': '863', u'策略发展总监': '2004', u'律师': '223', u'经纪人/星探': '178', u'IT项目执行/协调人员': '819', u'培训策划': '787', u'活动策划': '749', u'成本会计': '527', u'无线电工程师': '318', u'模具工': '343', u'户外/游戏教练': '2088', u'医学影像/放射科医师': '900', u'销售运营经理/主管': '662', u'销售运营专员/助理': '661', u'仪器/仪表/计量工程师': '086', u'烫金工': '2128', u'工装工程师': '2204', u'驾驶教练': '2155', u'工艺品/珠宝设计': '365', u'机电工程师': '732', u'数码直印/菲林输出': '2131', u'厨师助理/学徒': '2073', u'客户服务经理': '390', u'Flash设计/开发': '555', u'收银员': '354', u'核保理赔': '197', u'互联网产品经理/主管': '316', u'售前/售后技术支持工程师': '392', u'绩效考核经理/主管': '619', u'能源/矿产项目管理': '833', u'生产项目经理/主管': '821', u'技工': '2205', u'电梯工': '2213', u'食品加工/处理': '635', u'二手车评估师': '484', u'普工/操作工': '344', u'汽车/摩托车工程师': '2196', u'网站架构设计师': '2037', u'客户总监': '845', u'兼职教师': '785', u'广告/会展项目管理': '609', u'电器研发工程师': '528', u'防损员/内保': '492', u'保险代理/经纪人/客户经理': '196', u'船长': '2157', u'样衣工': '523', u'特教(特殊教育)': '2117', u'医药化学分析': '763', u'软件工程师': '045', u'医药代表': '010', u'奢侈品销售': '494', u'综合业务经理/主管': '719', u'店面/展览/展示/陈列设计': '755', u'市场运营': '2061', u'收银主管': '794', u'公关专员/助理': '163', u'包装工程师': '592', u'标准化工程师': '2063', u'市场策划/企划专员/助理': '605', u'建筑工程师': '096', u'销售培训师/讲师': '463', u'IT技术支持/维护经理': '058', u'心理医生': '373', u'软件研发工程师': '079', u'集装箱维护': '2159', u'海关事务管理': '2167', u'系统集成工程师': '666', u'电池/电源开发': '083', u'大客户销售经理': '660', u'理货员': '355', u'汽车动力系统工程师': '872', u'视频主播': '2141', u'环境管理/园林景区保护': '379', u'核力/火力工程师': '290', u'区域销售经理/主管': '843', u'化工工程师': '023', u'洗碗工': '2216', u'环保技术工程师': '380', u'舞蹈老师': '2115', u'生产跟单': '2017', u'汽车电工': '2233', u'后期制作': '185', u'房地产评估': '567', u'地产店长/经理': '2030', u'石油/天然气技术人员': '284', u'供应商/采购质量管理': '330', u'焊接工程师/技师': '2192', u'验光师': '2091', u'现场应用工程师（FAE）': '084', u'汽车装饰美容': '483', u'Java开发工程师': '2040', u'媒介销售': '2181', u'财务顾问': '714', u'汽车维修/保养': '728', u'家教': '359', u'培训助理/助教': '788', u'后勤人员': '119', u'前厅接待/礼仪/迎宾': '277', u'英语翻译': '268', u'视觉设计': '674', u'移动通信工程师': '324', u'证券/投资客户主管': '908', u'营运主管': '2013', u'调色员': '2127', u'营运经理': '2014', u'客户主管': '548', u'冲压工程师/技师': '2193', u'游戏测试': '2064', u'电信网络工程师': '325', u'培训督导': '786', u'无线/射频通信工程师': '321', u'银行卡/电子银行业务推广': '571', u'促销经理': '2176', u'监控维护': '2033', u'学术推广': '853', u'钳工/机修工/钣金工': '338', u'饲料销售': '654', u'品牌策划': '2174', u'纸样师/车板师': '2239', u'转播工程师': '2140', u'插花设计师': '2000', u'科研人员': '255', u'客户咨询热线/呼叫中心人员': '260', u'团购经理/主管': '455', u'网页设计/制作/美工': '054', u'投资经理': '2105', u'药品市场推广专员/助理': '767', u'航空乘务': '737', u'客户服务总监': '391', u'服装/纺织设计总监': '2238', u'销售总监': '000', u'园林/景观设计': '563', u'数控操作': '2198', u'SEO/SEM': '866', u'电力系统研发工程师': '2020', u'业务分析专员/助理': '2231', u'商务经理/主管': '461', u'列车驾驶/操作': '879', u'保洁': '651', u'会计/会计师': '207', u'财务主管/总帐主管': '202', u'拍卖师': '929', u'药房管理/药剂师': '232', u'供应商开发': '663', u'房地产项目配套工程师': '829', u'网络运营专员/助理': '670', u'电气工程师': '865', u'瑜伽教练': '2087', u'缝纫工': '2241', u'环境评价工程师': '616', u'集成电路IC设计/应用工程师': '404', u'机械设备工程师': '583', u'公司业务': '572', u'房地产客服': '2032', u'大学教师': '358', u'证券分析/金融研究': '575', u'质量管理/测试工程师': '251', u'家用电器/数码产品研发': '085', u'WEB前端开发': '864', u'网店推广': '2052', u'服装/纺织/皮革跟单': '520', u'临床推广经理': '2018', u'税务经理/主管': '209', u'裁床': '524', u'记者/采编': '612', u'工程机械主管': '333', u'销售主管': '002', u'4S店管理': '477', u'其他语种翻译': '274', u'配音员': '891', u'培训师/讲师': '131', u'脚本开发工程师': '2043', u'商务专员/助理': '460', u'激光/光电子技术': '411', u'临床数据分析员': '765', u'网络/在线客服': '846', u'传菜员': '2075', u'销售数据分析': '462', u'技术文档工程师': '090', u'会务经理/主管': '857', u'网站运营总监/经理': '2048', u'证券总监/部门经理': '349', u'造纸研发': '2009', u'文科教师': '792', u'铲车/叉车工': '341', u'理财顾问/财务规划师': '2251', u'材料工程师': '593', u'安全管理': '331', u'架线和管道工程技术': '886', u'实验室负责人/工程师': '2188', u'化验/检验': '067', u'销售行政专员/助理': '015', u'电话采编': '761', u'工程监理/质量管理': '106', u'船务/空运陆运操作': '2168', u'系统架构设计师': '667', u'废气处理工程师': '904', u'调酒师/茶艺师/咖啡师': '369', u'麻醉医生': '647', u'艺术指导/舞美设计': '180', u'保险产品开发/项目策划': '540', u'拖压工': '2209', u'环境监测工程师': '905', u'培训生': '302', u'专业顾问': '220', u'物流/仓储项目管理': '744', u'医药销售经理/主管': '844', u'金融/经济研究员': '2100', u'电话销售': '011', u'配置管理工程师': '868', u'园林景观设计师': '2118', u'咨询项目管理': '783', u'综合业务专员/助理': '720', u'财务分析经理/主管': '203', u'土建勘察': '2025', u'晒版员': '2129', u'嵌入式硬件开发': '407', u'合同管理': '497', u'买手': '664', u'市场营销经理': '159', u'工程总监': '2024', u'工厂厂长/副厂长': '061', u'市场文案策划': '851', u'电子/电器工程师': '078', u'会展策划/设计': '610', u'电焊工/铆焊工': '337', u'银行柜员': '2112', u'软件测试': '695', u'投资银行业务': '576', u'网络/在线销售': '924', u'药品市场推广经理/主管': '766', u'淘宝/微信运营专员/主管': '2058', u'日语翻译': '269', u'集装箱业务': '741', u'万能工': '2218', u'电子/电器项目管理': '824', u'化工项目管理': '827', u'广告创意/设计师': '510', u'西班牙语翻译': '630', u'客户服务主管': '549', u'汽车零配件销售': '479', u'玩具设计': '752', u'护士/护理人员': '397', u'猎头顾问/助理': '128', u'物业招商管理': '465', u'渠道/分销专员': '007', u'汽车质量管理/检验检测': '727', u'家政人员': '308', u'CNC/数控工程师': '591', u'林业技术人员': '914', u'工业设计': '750', u'服装/纺织品/皮革销售': '516', u'生产经理/车间主任': '065', u'鞋子设计': '2249', u'生态治理/规划': '266', u'整经工': '2248', u'网络运营管理': '052', u'钟点工': '2227', u'会务专员/助理': '172', u'导演/编导': '175', u'监察人员': '2029', u'店员/营业员/导购员': '017', u'城市规划与设计': '103', u'证券/投资项目管理': '468', u'通信研发工程师': '500', u'质量检验员/测试员': '252', u'首席财务官CFO': '399', u'成本经理/主管': '211', u'典当业务': '931', u'数据库开发工程师': '047', u'美体师': '2089', u'图书管理员': '2145', u'薪酬福利专员/助理': '780', u'汽车售后服务/客户服务': '581', u'网站推广': '451', u'保安': '104', u'电子/电器设备工程师': '401', u'投资银行财务分析': '2106', u'制造工程师': '075', u'游戏策划': '671', u'信贷管理/资信评估/分析': '194', u'建筑工程测绘/测量': '383', u'服装/纺织/皮革项目管理': '517', u'薪酬福利经理/主管': '127', u'房地产销售主管': '882', u'业务拓展经理/主管': '454', u'信息技术标准化工程师': '692', u'团购业务员': '452', u'注塑工程师': '874', u'政府事务管理': '768', u'护理主任/护士长': '2093', u'产品总监': '2046', u'酒店管理': '281', u'网络管理员': '388', u'外科医生': '643', u'发行管理': '183', u'医药招商': '496', u'美术编辑/美术设计': '892', u'针灸/推拿': '375', u'技术研发工程师': '2184', u'保姆/母婴护理': '901', u'文案策划': '152', u'影视策划/制作人员': '2126', u'游泳教练': '2085', u'动物营养/饲料研发': '913', u'电子商务专员/助理': '677', u'网络工程师': '055', u'招聘经理/主管': '123', u'市场总监': '158', u'电路工程师/技术员': '089', u'有线传输工程师': '320', u'合伙人': '143', u'建筑施工现场管理': '705', u'VIP专员': '2147', u'医疗器械销售': '773', u'数据库管理员': '389', u'知识产权/专利顾问/代理人': '226', u'法务经理/主管': '225', u'电分操作员': '2133', u'变压器与磁电工程师': '681', u'业务拓展专员/助理': '602', u'情报信息分析': '221', u'化妆师/造型师/服装/道具': '182', u'党工团干事': '2144', u'健身/美体/舞蹈教练': '376', u'促销员': '173', u'导游/票务': '282', u'市场主管': '604', u'水族馆表演演员': '2173', u'保险电销': '2252', u'物流总监': '241', u'特效设计': '673', u'水利/港口工程技术': '885', u'机动车司机/驾驶': '246', u'装订工': '2130', u'审计专员/助理': '213', u'仿真应用工程师': '2035', u'志愿者/义工': '658', u'地质勘查/选矿/采矿': '372', u'印染工': '2244', u'机械结构工程师': '586', u'光源/照明工程师': '559', u'物料主管/专员': '2165', u'橱柜设计师': '2027', u'活动执行': '2182', u'企业/业务发展经理': '2237', u'调墨技师': '2132', u'电力工程师/技术员': '286', u'投资/理财服务': '188', u'生产主管/督导/组长': '064', u'房地产项目策划专员/助理': '351', u'资产/资金管理': '570', u'电工': '599', u'大堂经理/领班': '276', u'网店客服': '2053', u'采购总监': '235', u'水运/陆运/空运销售': '2170', u'飞机驾驶/操作': '245', u'化验/检验科医师': '374', u'广告创意/设计经理/主管': '757', u'电脑放码员': '738', u'财务助理': '205', u'报关员': '239', u'园艺师': '915', u'光伏系统工程师': '2195', u'家居用品设计': '751', u'金融服务经理': '2104', u'三维/3D设计/制作': '554', u'广告客户代表': '507', u'数据通信工程师': '323', u'会计助理/文员': '713', u'电子商务经理/主管': '676', u'组装工': '2206', u'灯光师': '2124', u'物业维修': '352', u'硬件测试': '696', u'医药学术推广': '775', u'土木/土建/结构工程师': '097', u'电信交换工程师': '322', u'外汇交易': '717', u'珠宝/收藏品鉴定': '811', u'信审核查': '725', u'进出口/信用证结算': '722', u'保险内勤': '539', u'车床/磨床/铣床/冲床工': '339', u'公共卫生/疾病监控': '2092', u'教学/教务管理人员': '132', u'专科医生': '2095', u'空调/热能工程师': '285', u'外籍教师': '2116', u'环境/健康/安全工程师': '529', u'环境/健康/安全经理/主管': '807', u'银行经理/主任': '347', u'采购经理/主管': '550', u'主笔设计师': '2122', u'个人业务部门经理/主管': '2108', u'银行大堂经理': '721', u'铸造/锻造工程师/技师': '590', u'德语翻译': '270', u'信用卡销售': '2111', u'总裁助理/总经理助理': '142', u'机械工程师': '029', u'保险项目经理/主管': '536', u'招商经理': '2150', u'风险管理/控制/稽查': '190', u'C语言开发工程师': '2042', u'市场营销专员/助理': '160', u'救生员': '638', u'风险控制': '724', u'广告制作执行': '514', u'道路/桥梁/隧道工程技术': '466', u'媒介策划/管理': '513', u'咨询顾问/咨询员': '219', u'水工/木工/油漆工': '342', u'动物育种/养殖': '655', u'CTO/CIO': '398', u'兼职': '659', u'平面设计经理/主管': '2120', u'细纱工': '2250', u'房地产项目策划经理/主管': '710', u'销售业务跟单': '927', u'旅游顾问': '530', u'塑料工程师': '614', u'公务员/事业单位人员': '305', u'生物工程/生物制药': '292', u'意大利语翻译': '631', u'投资者关系': '2002', u'游戏设计/开发': '057', u'市场通路专员': '2175', u'电子工程师/技术员': '2044', u'内容运营': '2062', u'快递员/速递员': '247', u'银行客户经理': '718', u'项目招投标': '2080', u'船舶设计与制造': '923', u'网店管理员': '2055', u'销售行政经理/主管': '459', u'汽车工程项目管理': '471', u'汽车销售': '469', u'版图设计工程师': '408', u'融资专员/助理': '810', u'餐厅服务员': '2067', u'体育老师/教练': '360', u'供应链管理': '488', u'婚礼/庆典策划服务': '611', u'医疗器械维修/保养': '774', u'系统工程师': '046', u'大学教授': '2114', u'高级业务跟单': '2178'}
		self.address = '10.4.16.39:8888'
		self.get_cookie1()
		with open(common.json_config_path) as f_log:
			f_read = f_log.read()
		logger = logging.getLogger(__name__)
		log_dict = json.loads(f_read)
		log_dict['handlers']['file']['filename'] = os.path.join(common.log_dir, 'input_zhilian.log')
		logging.config.dictConfig(log_dict)

	def crawl_zhilian_test(self):
		t0 = time.time()
		print 'first fetch zhilian .........'
		self.crawl_zhilian()
		t1 = time.time() - t0
		logging.info('first crawl zhilian finish use time %s.......' % str(t1))

	def crawl_zhilian(self, area=None, year=None, age=None, degree=None, keyword=None, industry=None,
						work_func=None, job_area=None, updatetime=None, page_num='1', sid=None):
		try:
			logging.info('start crawl zhilian search 00000000')
			t0 = time.time()
			url = r'http://rdsearch.zhaopin.com/Home/ResultForCustom?'

			if keyword:
				self.get_dict['SF_1_1_1'] = keyword

			if area:
				self.get_dict['SF_1_1_6'] = self.area_dict[area]

			if year:
				self.get_dict['SF_1_1_4'] = year

			if age:
				self.get_dict['SF_1_1_8'] = age

			if degree:
				self.get_dict['SF_1_1_5'] = degree

			if industry:
				self.get_dict['SF_1_1_3'] = self.convert_industry[industry]

			if work_func:
				self.get_dict['SF_1_1_2'] = self.convert_func[work_func]

			if job_area:
				self.get_dict['SF_1_1_18'] = self.area_dict[job_area]

			if updatetime:
				self.get_dict['SF_1_1_7'] = updatetime

			if page_num:
				self.get_dict['pageIndex'] = page_num

			if sid:
				self.get_dict.pop('pageSize')
				self.get_dict.pop('pageIndex')
				self.get_dict['orderBy'] = 'DATE_MODIFIED,1'
				self.get_dict['SF_1_1_24'] = sid

			get_url = urllib.urlencode(self.get_dict)
			url = url + get_url
			logging.info('request zhilian url is %s ' % url)
			html = self.proxy_url_get(url, self.address)
			print url
			with open('/data/fetch/db/trans/zlsearch.html', 'w+') as f:
				f.write(html)

			if html.find('name="login"') > 0:
				self.get_cookie1()
				logging.info('login2 .......')
				html = self.proxy_url_get(url, self.address)
			try:
				soup = BeautifulSoup(html, 'html.parser')
				t1 = time.time() - t0
				logging.info('soup use time is %s' % str(t1))
				resume_count = soup.select('.rd-resumelist-span')[0].get_text().strip()
				page_count = soup.select('#rd-resumelist-pageNum')[0].get_text().split('/')[1]
				show_list = soup.select('tr[valign=top]')
			except Exception, e:
				print traceback.format_exc(), e
				logging.error('fetch return html error %s', str(e))
				with open('/data/fetch/db/trans/error_zhilian.html', 'w+') as f_error:
					f_error.write(html)
				return json.dumps({'code': '-1', 'msg': 'fetch error'})

			html_array = {'resume_list': '', 'page_count': '', 'resume_count': ''}
			resume_list = []
			i = 0
			while i < len(show_list):
				html_dict = {'id': '', 'age': '', 'function': '', 'degree': '', 'gender': '', 'resume_update': '', 'resume_name': '', 'area': ''}
				try:
					html_dict['resume_name'] = show_list[i].select('td')[1].get_text().strip()
				except IndexError:
					break
				html_dict['function'] = show_list[i].select('td')[3].get_text().strip()
				html_dict['degree'] = show_list[i].select('td')[4].get_text()
				html_dict['gender'] = show_list[i].select('td')[5].get_text()
				html_dict['age'] = show_list[i].select('td')[6].get_text()
				html_dict['area'] = show_list[i].select('td')[7].get_text()
				html_dict['id'] = soup.select('.info')[i]['tag'].strip('_1')
				html_dict['resume_update'] = '20' + show_list[i].select('td')[8].get_text()
				resume_list.append(html_dict)
				i += 1
			db = connect_mysql()
			cur = db.cursor()
			sql_back = """SELECT id,phone,talent_mark FROM `talent` WHERE talent_mark in ({})"""
			sql_or = ''
			for resume in resume_list:
				s = "'" + str(resume['id']) + "'" + ','
				sql_or += s
			sql_id_common = sql_back.format(sql_or.rstrip(','))
			cur.execute(sql_id_common)
			zid_phone_back = cur.fetchall()
			db.close()
			if zid_phone_back:
				for zid in zid_phone_back:
					for resume in resume_list:
						if zid[2] == resume['id']:
							logging.info('>>>>>>> zid is %s' % str(zid))
							resume['z_id'] = zid[0]
							resume['phone'] = zid[1]
				else:
					for resume in resume_list:
						if 'z_id' not in resume.keys():
							resume['z_id'] = None
							resume['phone'] = None
			else:
				for resume in resume_list:
					resume['z_id'] = None
					resume['phone'] = None

			html_array['resume_list'] = resume_list
			html_array['resume_count'] = resume_count
			html_array['page_count'] = page_count

			html_array = json.dumps(html_array)
			t2 = time.time() - t0
			logging.info('finish search return use time %s -----' % str(t2))
			print '*********---END--**********'
			return html_array

		except Exception, e:
			print traceback.format_exc(), e
			logging.error('search error fetch fail')
			with open('/data/fetch/db/trans/error_zhilian.html', 'w+') as f_error:
				f_error.write(html)
			return json.dumps({'code': '-5', 'msg': 'error html'})


def connect_mysql():
	sq_config = {
		'host': "10.4.14.233",
		'user': "tuike",
		'passwd': "sv8VW6VhmxUZjTrU",
		'db': "tuike",
		'charset': "utf8",
	}
	db = MySQLdb.connect(**sq_config)
	return db



if __name__ == '__main__':
	print 'zhilian+++++++'